In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("weather_data2.csv")
df

          day temperature windspeed  event
0  01-01-2017        32 f       ok6   Rain
1  01-02-2017      -99999         7  Sunny
2  01-03-2017          28    -99999   Snow
3  01-04-2017      -99999         7      0
4  01-05-2017        32 c    -99999   Rain
5  01-06-2017          31         2  Sunny
6  01-06-2017          34    5 yyee      0

In [2]:
# we can do replacement(bacis) with this 
new_df = df.replace(-99999, np.nan)
new_df

          day temperature windspeed  event
0  01-01-2017        32 f       ok6   Rain
1  01-02-2017      -99999         7  Sunny
2  01-03-2017          28    -99999   Snow
3  01-04-2017      -99999         7      0
4  01-05-2017        32 c    -99999   Rain
5  01-06-2017          31         2  Sunny
6  01-06-2017          34    5 yyee      0

In [3]:
# But this will not give us our desired value 
# we can also use a list 
new_df = df.replace([-99999, -88888], np.nan)
new_df

          day temperature windspeed  event
0  01-01-2017        32 f       ok6   Rain
1  01-02-2017      -99999         7  Sunny
2  01-03-2017          28    -99999   Snow
3  01-04-2017      -99999         7      0
4  01-05-2017        32 c    -99999   Rain
5  01-06-2017          31         2  Sunny
6  01-06-2017          34    5 yyee      0

In [4]:
# Replace values based on specific values 
# By using a dictionary
new_df = df.replace({
    'temperature': -99999,
    'windspeed': - 99999,
    'event': '0'
}, np.nan)
new_df

          day temperature windspeed  event
0  01-01-2017        32 f       ok6   Rain
1  01-02-2017      -99999         7  Sunny
2  01-03-2017          28    -99999   Snow
3  01-04-2017      -99999         7    NaN
4  01-05-2017        32 c    -99999   Rain
5  01-06-2017          31         2  Sunny
6  01-06-2017          34    5 yyee    NaN

In [5]:
new_df = df.replace({
    -99999:np.nan,
    '0':'sunny'
})
new_df

          day temperature windspeed  event
0  01-01-2017        32 f       ok6   Rain
1  01-02-2017      -99999         7  Sunny
2  01-03-2017          28    -99999   Snow
3  01-04-2017      -99999         7  sunny
4  01-05-2017        32 c    -99999   Rain
5  01-06-2017          31         2  Sunny
6  01-06-2017          34    5 yyee  sunny

In [6]:
# ---------------------------------------------regex -------------------------------------------------

In [7]:
df = pd.read_csv("weather_data2.csv")
df

          day temperature windspeed  event
0  01-01-2017        32 f       ok6   Rain
1  01-02-2017      -99999         7  Sunny
2  01-03-2017          28    -99999   Snow
3  01-04-2017      -99999         7      0
4  01-05-2017        32 c    -99999   Rain
5  01-06-2017          31         2  Sunny
6  01-06-2017          34    5 yyee      0

In [8]:
#now we have some data which contain number as well as alphabet
#we can also alter this kind of data
new_df = df.replace('[A-Za-z]', '', regex = True)
new_df

          day temperature windspeed event
0  01-01-2017         32          6
1  01-02-2017      -99999         7
2  01-03-2017          28    -99999
3  01-04-2017      -99999         7     0
4  01-05-2017         32     -99999
5  01-06-2017          31         2
6  01-06-2017          34        5      0

In [9]:
# But it also erases all the alphabet of the event col also

In [10]:
# now we are removing the value from the col which we want
new_df = df.replace({
    'temperature': '[A-Za-z]',
    'windspeed': '[A-Za-z]'
}, '', regex = True)
new_df

          day temperature windspeed  event
0  01-01-2017         32          6   Rain
1  01-02-2017      -99999         7  Sunny
2  01-03-2017          28    -99999   Snow
3  01-04-2017      -99999         7      0
4  01-05-2017         32     -99999   Rain
5  01-06-2017          31         2  Sunny
6  01-06-2017          34        5       0

In [11]:
new_df = df.to_csv("new_replaced_weather_data2.csv")

In [12]:
#list of values with anthere list of values
df =pd.DataFrame({
    'score':['exceptional', 'average', 'good', 'poor', 'average', 'exceptional'],
    'student':['rob', 'maya', 'parthiv', 'tom', 'julian', 'erica']
})
df

         score  student
0  exceptional      rob
1      average     maya
2         good  parthiv
3         poor      tom
4      average   julian
5  exceptional    erica

In [13]:
# Firstly, we are going to map the values 
new_df = df.replace(['poor', 'average', 'good', 'exceptional'], [1,2,3,4])
new_df

C:\Users\abhiraj\AppData\Local\Temp\ipykernel_19228\248037819.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  new_df = df.replace(['poor', 'average', 'good', 'exceptional'], [1,2,3,4])

   score  student
0      4      rob
1      2     maya
2      3  parthiv
3      1      tom
4      2   julian
5      4    erica